In [2]:
import pandas as pd
df4 = pd.read_csv("https://datasets.imdbws.com/title.crew.tsv.gz", sep = "\t", nrows=1000)
df4.head(10)

      tconst            directors    writers
0  tt0000001            nm0005690         \N
1  tt0000002            nm0721526         \N
2  tt0000003            nm0721526         \N
3  tt0000004            nm0721526         \N
4  tt0000005            nm0005690         \N
5  tt0000006            nm0005690         \N
6  tt0000007  nm0005690,nm0374658         \N
7  tt0000008            nm0005690         \N
8  tt0000009            nm0085156  nm0085156
9  tt0000010            nm0525910         \N

In [3]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   tconst     1000 non-null   object
 1   directors  1000 non-null   object
 2   writers    1000 non-null   object
dtypes: object(3)
memory usage: 23.6+ KB

In [4]:
df4.shape

(1000, 3)

In [5]:
df4.dtypes

tconst       object
directors    object
writers      object
dtype: object

In [6]:
df4.describe()

           tconst  directors writers
count        1000       1000    1000
unique       1000        139     140
top     tt0001011  nm0349785      \N
freq            1        172     651